#!/usz/bin/env python
# -*- coding:utf-8 -*-

"""
@author     : zgf
@brief      : 认识python
life is short , I need python
"""


# ========================================= 行最大长度 =========================================
# 所有行限制的最大字符数为79

# flag = True
flag = False
if flag:
    pass


# ========================================= 缩进 =========================================
# 用缩进表示语句间的逻辑
# 缩进量:4字符

# flag = True
flag = False
if flag:
    for i in [1, 2, 3]:
        print(i)
    print("打印结束")

# ========================================= 空格 =========================================
# 二元运算符两边加一个空格

# flag = True
flag = False
if flag:
    x = 2  # 赋值
    y = 2
    y += 4  # 增量
    print(6 > 2)  # 比较
    x = x * 2 - 1  # 使用不同优先级的运算符,考虑在最低优先级的运算符周围添加空格
    z = x * x - y * y  # 使用不同优先级的运算符,考虑在最低优先级的运算符周围添加空格
    z = (x + y) * (x - y)
    x, y = 1, 2  # 在逗号后添加空格,添加一个空格就够了
    print(z)
